<template>
    <div class="ele-body container">
        <a-card style="border-radius: 4px;" class="baseInfo">
            <a-tabs v-model:activeKey="activeKey">
                <a-tab-pane key="1" tab="Tab 1">Content of Tab Pane 1</a-tab-pane>
                <a-tab-pane key="2" tab="Tab 2" force-render>Content of Tab Pane 2</a-tab-pane>
                <a-tab-pane key="3" tab="Tab 3">Content of Tab Pane 3</a-tab-pane>
            </a-tabs>
            <div class="infoContent">
                <p>菜品名称：{{ name }}</p>
                <p>菜品编号：{{ code }}</p>
                <p>菜品分类：炒菜</p>
                <p>菜品缩写：-</p>
                <p>兼容型号：KUKE4.0</p>
                <p>菜品简介：-</p>
                <p>菜品原料：-</p>
                <p>菜品标签：-</p>
                <p>菜品售价：0元</p>
                <p>菜品划线价：-</p>
                <p>菜品基础销量：-</p>
                <p>菜品状态：待审核</p>
            </div>
        </a-card>
        <!-- <a-card style="border-radius: 4px;margin-top:10px;" title="备菜流程" class="flowContainer">
            <div class="flowContent">
                <div class="flowTop">
                    图片格式为jpg、jpeg、png，建议尺寸为350 x 214，文件大小建议不超过10MB，最多上传5张；视频格式为mp4，推荐视频比例：10:6，大小不超过200M
                </div>
                <div v-for="item in menu" :key="item.id" style="margin-left: 20px;">
                    <p>{{ item.name }}</p>
                    <p style="display: flex;align-items: center;">
                        <div style="margin-right: 20px;">请选择</div>
                        <div>
                            <a-select
                                ref="select"
                                v-model:value="value1"
                                style="width: 150px;margin-right: 20px;"
                            >
                                <a-select-option value="净菜库">净菜库</a-select-option>
                                <a-select-option value="预处理原料">预处理原料</a-select-option>
                            </a-select>
                        </div>
                        <div>
                            <a-select
                                ref="select"
                                v-model:value="item.type"
                                show-search
                                placeholder="请选择净菜库名称"
                                style="width: 190px;margin-right: 20px;"
                            >
                                <a-select-option v-for="item in selectData" :key="item.id" :value="item.name">{{ item.name }}</a-select-option>
                            </a-select>
                        </div>
                        <div>
                            <a-button type="primary">确定</a-button>
                        </div>
                    </p>
                    <p style="display: flex;align-items: center;">
                        <div style="margin-right:10px;">
                            <a-upload
                                list-type="picture-card"
                                v-model:file-list="fileList"
                                @preview="handlePreview"
                            >
                                <div v-if="fileList.length < 8">
                                    <plus-outlined />
                                    <div class="ant-upload-text">上传图片</div>
                                </div>
                            </a-upload>
                            <a-modal :visible="previewVisible" :footer="null" @cancel="handleCancel">
                                <img alt="example" style="width: 100%" :src="previewImage" />
                            </a-modal>
                        </div>
                        <div>
                            <a-upload
                                list-type="picture-card"
                                v-model:file-list="fileList"
                                @preview="handlePreview"
                            >
                                <div v-if="fileList.length < 8">
                                    <plus-outlined />
                                    <div class="ant-upload-text">上传视频</div>
                                </div>
                            </a-upload>
                        </div>
                    </p>
                    <p>
                        <a-textarea v-model:value="item.des" style="border-radius: 4px;width: 90%;" placeholder="Basic usage" :rows="4" />
                    </p>
                    <p>
                        <a-divider />
                    </p>
                </div>
            </div>
        </a-card> -->
    </div>
</template>
<script>
import { defineComponent,ref} from 'vue';
import { useRouter } from 'vue-router';
import { PlusOutlined } from '@ant-design/icons-vue';
export default defineComponent({
    components: {
        PlusOutlined,
    },
    setup(){
        const {currentRoute}=useRouter()
        let name=ref('-')
        let code=ref('-')
        let value1=ref('净菜库')
        let value2=ref('')
        let menu1=ref([
            {
                id:1,
                name:'步骤一',
                type:"鸡肉",
                des:"腌制无骨去皮鸡腿肉块:\n解冻充分后，去皮去脆骨，直刀切成2*2的块\n共分五步，具体如下：\n1）去皮：将鸡腿肉充分解冻后，去皮；平刀将鸡皮割下\n2）去软骨：检查鸡腿肉上有无软骨，若有将其剔除\n3）切条：将去皮去软骨的鸡腿肉，直刀切成宽2cm的条\n4）切块：将切好的条再直刀切成2cm的块\n5）腌制：切完块后清洗干净，充分沥干水分；\n6）取2000克鸡腿肉丁进行腌制\n①第一步-加入盐12克，花雕酒12克，老抽12克，生抽40克，味精12克，白胡椒粉4克，水80克，充分搅拌；搅拌时双手由底部向上抄起鸡块，向下摔下，拍搅4-5分钟，拍搅至无水分呈糊状\n②第二步-加入玉米淀粉80克，搅拌时双手由底部向上抄起，然后向下摔打4-5分钟，拍搅至上浆上劲—观察鸡块颜色，明亮润滑说明已上劲\n③第三步-加入油40克，充分搅拌均匀后，备用"
            },
            {
                id:2,
                name:'步骤二',
                type:"生姜片",
                des:"生姜片\n清洗削皮后，将生姜切成长、宽1.5cm，厚0.2cm的薄片\n共分四步，具体如下：\n1）清洗削皮：将生姜清洗干净后削皮\n2）切条：去掉边角后，直刀将生姜切成宽1.5cm的条\n3）切块：将切好的生姜条横放，直刀切成宽1.5cm的块\n4）切片：将切好的小块再直刀切成宽0.2cm的片"
            },
            {
                id:3,
                name:'步骤三',
                type:"蒜片",
                des:"蒜片\n直刀将蒜米切成厚0.2cm自然长度的片\n共分两步，具体如下：\n1）洗净切跟：将去皮蒜米清洗干净后，用刀切掉根尾\n2）切片：直刀将蒜米切成厚0.2cm的片"
            },
            {
                id:4,
                name:'步骤四',
                type:"大葱葱花",
                des:"大葱葱花\n切成长和宽为0.5cm的葱花\n共分四步，具体如下：\n1）择菜清洗切段：去叶去老皮择净去根后，清洗干净；直刀，将大葱切成长9cm，自然直径的葱段\n2）一开二：将切好段的大葱直刀一开二\n3）切丝：取切好的大葱，直刀切成0.5cm的丝\n4）切葱花：将切好的大葱丝，直刀切成0.5cm的葱花"
            },
            {
                id:5,
                name:'步骤五',
                type:"干调料",
                des:"1号料盒：\n干红辣椒段40克\n姜片60克\n蒜片120克\n大葱葱花50克\n花椒12克\n2号料盒：\n腌制鸡腿肉丁1040克\n3号料盒：\n白砂糖240克\n4号料盒：大葱葱花120克\n熟原味花生米160克\n花椒油（淋在食材上）80克"
            },
            {
                id:6,
                name:'步骤六',
                type:"干调料",
                des:"注意：\n1）装盒时：带有酱汁或者液体调料的料盒装配时，务必将酱汁或液体料汁置于食材之上，防止粘在料盒上\n2）炒制前：务必擦干锅内水渍"
            },
        ])
        let menu2=ref([
            {
                id:1,
                name:'步骤一',
                type:"五花肉片",
                des:"猪五花肉片（小）：去皮五花肉切成长3.5cm，宽2.5cm，厚0.3cm的片状切法：切块：五花肉切成宽为2.5cm，厚为五花肉孜然厚度的长条,去皮；机器：宽为2.5cm的边朝下放入机器，切成3.5*2.5*0.3cm的片"
            },
            {
                id:2,
                name:'步骤二',
                type:"螺丝椒片",
                des:"螺丝椒片：螺丝椒去根、去籽，切成长6.5cm，宽3cm，成棱形片状 \n切法： \n1）螺丝椒和刀的夹角为45°，切一刀长度为6.5cm \n2）朝一个方向滚动螺丝椒，切面朝上，间隔3cm切一刀，保持6.5cm的长度不变 \n3）继续滚动，切面朝上，间隔3cm切一刀，重复此动作"
            },
            {
                id:3,
                name:'步骤三',
                type:"拍蒜碎",
                des:"拍蒜碎：\n方法一：手切：去皮蒜米先拍后切，颗粒度0.8cm，成碎状 \n方法二：机搅：去皮蒜米300克，机器高档，按压开关3秒松开，按6下，成颗粒度0.8cm的蒜碎"
            },
            {
                id:4,
                name:'步骤四',
                type:"",
                des:"注意：因辣椒炒肉食材特性，多份菜配比不是单份的整数倍，称重时需注意"
            },
        ])
        let menu3=ref([
            {
                id:1,
                name:'步骤一',
                type:"",
                des:""
            },
        ])
        let menu4=ref([
            {
                id:1,
                name:'步骤一',
                type:"娃娃菜",
                des:"娃娃菜块：娃娃菜切成长宽4.5cm的块后，清洗干净，沥水备用\n切法：娃娃菜切成长宽4.5cm的块\n注意：娃娃菜瓣宽度大于4.5cm的需从中间切开，再切成长4.5cm的块"
            },
        ])
        let menu5=ref([
            {
                id:1,
                name:'步骤一',
                type:"黄心土豆丝",
                des:"黄心土豆丝：黄心土豆清洗削皮，切成或擦成长5-8cm，宽、厚约0.3cm的丝；\n切好的丝浸泡在凉水中，使用时沥干水分分装"
            },
            {
                id:2,
                name:'步骤二',
                type:"香葱条",
                des:"香葱条：香葱剥老皮去根洗净，切成长4cm的条"
            },
            {
                id:3,
                name:'步骤三',
                type:"干红辣椒段",
                des:"干红辣椒段：干红辣椒段筛去籽后使用"
            },
        ])
        let menu6=ref([
            {
                id:1,
                name:'步骤一',
                type:"米粉段",
                des:"米粉段：米粉充分泡发后拌油，剪成6cm的段；\n1、泡：取420克生米粉，放入提前准备好的凉中泡90分钟，沥干水分；\n2、剪：用筷子挑起拌好油的米粉，用剪刀在3cm处剪开，米粉总长6cm；"
            },
            {
                id:2,
                name:'步骤二',
                type:"鸡蛋液",
                des:"鸡蛋液：\n1、取蛋：拿取鸡蛋，磕破蛋壳将蛋黄蛋清倒入容器中；\n2、搅拌：将蛋黄和蛋清充分搅拌均匀，备用；"
            },
            {
                id:3,
                name:'步骤三',
                type:"洋葱丝",
                des:"洋葱丝：直刀将洋葱切成0.3cm的丝；\n1、剥皮清洗：将洋葱皮剥去，并清洗干净，直刀切掉根部；\n2、一开二：直刀，将洋葱一开二；\n3、切条：将洋葱块直刀切成宽0.3cm的丝；"
            },
            {
                id:4,
                name:'步骤四',
                type:"绿豆芽",
                des:"绿豆芽：清洗干净去豆皮后，备用；"
            },
            {
                id:5,
                name:'步骤五',
                type:"胡萝卜丝",
                des:"胡萝卜丝：\n1、清洗去根：将胡萝卜清洗干净后，去根茎；\n2、切丝：使用0.3cm刀片的切丝器，将胡萝卜斜45°沿切丝器切下；"
            },
            {
                id:6,
                name:'步骤六',
                type:"韭黄段",
                des:"韭黄段：将韭黄直刀切成长4cm的段；\n1、摘菜清洗：去掉烂叶黄叶根部择净后，清洗干净；\n2、切段：直刀，将韭黄切成4cm的段；"
            },
            {
                id:7,
                name:'步骤七',
                type:"",
                des:"注意：\n炒制前务必将锅内水渍擦干净。"
            },
        ])
        let menu7=ref([
            {
                id:1,
                name:'步骤一',
                type:"鸡胸肉块",
                des:"鸡胸肉块：充分解冻后，直刀切长1.5cm，宽1.5cm，厚1cm的块\n1、解冻：将鸡胸肉充分解冻后，备用\n2、切薄：横刀，将鸡胸肉分成厚度为1.5cm的两块\n3、切条：先取一块分好的鸡胸肉块，直刀切成1.5cm的条\n4、切块：将鸡胸肉条直刀，切成1cm的块；\n5、清洗：切完鸡块后用清水清洗干净后，务必充分沥干水分"
            },
            {
                id:2,
                name:'步骤二',
                type:"鸡蛋液",
                des:"第一步：加入小苏打0.5克，盐1克，生抽5克，再加入提前准备好的鸡蛋液50克；充分搅拌均匀后泡10分钟\n第二步：10分钟后，再次搅拌，搅拌时双手由底部向上抄起鸡块，向下摔下，拍搅4-5分钟，拍搅至无水分呈糊状\n第三步：加入玉米淀粉40克，搅拌时双手由底部向上抄起，然后向下摔打，拍搅至上浆上劲—观察鸡块颜色，明亮润滑说明已上劲\n第四步：加入油30克，不用搅拌，封膜放入冷藏2小时后，口感更加"
            },
            {
                id:3,
                name:'步骤三',
                type:"青尖椒块",
                des:"青尖椒块：切配标准及加工方法同红尖椒块"
            },
            {
                id:4,
                name:'步骤四',
                type:"生姜片",
                des:"生姜片：将生姜切成1.5cm见方，厚0.2cm片\n1、清洗去皮：将生姜清洗干净，用削皮刀削皮\n2、切段：直刀，将生姜直刀切成1.5cm的段\n3、切块：直刀，将生姜段切成长1.5cm的小块\n4、切片：将小块生姜直刀切成厚0.2cm的片"
            },
            {
                id:5,
                name:'步骤五',
                type:"蒜片",
                des:"蒜片：直刀将蒜米切成厚0.2cm自然长度的片\n1、洗净切跟：将去皮蒜米清洗干净后，用刀切掉根尾\n2、切片：直刀将蒜米切成厚0.2cm的片"
            },
            {
                id:6,
                name:'步骤六',
                type:"泡二荆条末",
                des:"泡二荆条末：将泡二荆条捣碎至末状\n1、装入：取200克泡二荆条红椒放入搅蒜机中\n2、打末：接通电源及开关，按压高档1分钟，取出备用"
            },
            {
                id:7,
                name:'步骤七',
                type:"",
                des:"豆瓣酱末：将豆瓣酱捣碎至末状\n1、装入：取200克豆瓣酱放入搅蒜机中\n2、打末：接通电源及开关，按压高档1分钟，取出备用"
            },
            {
                id:8,
                name:'步骤八',
                type:"泡二荆条末+豆瓣酱酱末",
                des:"泡二荆条末+豆瓣酱酱末：将两种打好的末混合在一起充分搅拌均匀，备用"
            },
            {
                id:9,
                name:'步骤九',
                type:"",
                des:"注意：\n带有酱汁或者液体调料的料盒装配时，务必将酱汁或液体料汁置于食材之上，防止粘在料盒上。"
            },
        ])
        let menu8=ref([
            {
                id:1,
                name:'步骤一',
                type:"菜心段",
                des:"菜心段：\n将菜心切成长5cm的段\n择菜清洗：将老叶蔫叶择去，且清洗干净\n1）区分切一：菜心杆直径1.5cm及以上，直刀从杆与叶交接之处下刀将整个菜心均匀一开三\n2）区分切二：菜心杆直径小于1.5cm，直刀从杆与叶交接之处将菜心一开二\n3）切段：直刀，再将分好的菜心切成长5cm的段"
            },
            {
                id:2,
                name:'步骤二',
                type:"拍蒜碎",
                des:"拍蒜碎（大）：\n将去皮蒜米先拍后剁，成碎状，颗粒度1cm"
            },
            {
                id:3,
                name:'步骤三',
                type:"料盒顺序",
                des:"1号料盒：\n拍蒜碎（大）160克\n2号料盒：\n菜心段560克\n3号料盒：\n菜心段560克\n4号料盒：\n菜心段560克"
            },
            {
                id:4,
                name:'步骤四',
                type:"",
                des:"注意：\n炒制前务必将锅内水渍擦干净。"
            },
        ])
        let menu=ref([
            {
                id:1,
                name:'步骤一',
                type:"",
                des:"注意：\n炒制前务必将锅内水渍擦干净。"
            },
        ])
        let des=ref('')
        const previewVisible = ref(false);
        const previewImage = ref('');
        const fileList=ref([])
        let selectData=ref([
            {
                "id": "221011",
                "name": "肌肉"
            },
            {
                "id": "22101",
                "name": "香油"
            },
            {
                "id": "22003",
                "name": "春笋片"
            },
            {
                "id": "22002",
                "name": "马蹄片"
            },
            {
                "id": "22001",
                "name": "藕带段"
            },
            {
                "id": "21826",
                "name": "蚝油"
            },
            {
                "id": "21825",
                "name": "拍姜"
            },
            {
                "id": "21824",
                "name": "羊后腿肉片"
            },
            {
                "id": "21823",
                "name": "莲藕段"
            },
            {
                "id": "21822",
                "name": "玉米块"
            },
            {
                "id": "21821",
                "name": "小排块"
            },
            {
                "id": "21820",
                "name": "仔鸡块"
            },
            {
                "id": "21819",
                "name": "熟腰果"
            },
            {
                "id": "21818",
                "name": "大葱丁"
            },
            {
                "id": "21817",
                "name": "干红灯笼椒块"
            },
            {
                "id": "21816",
                "name": "小排段"
            },
            {
                "id": "21815",
                "name": "猪里脊肉丝"
            },
            {
                "id": "21814",
                "name": "秋葵块"
            },
            {
                "id": "21813",
                "name": "干贝"
            },
            {
                "id": "21812",
                "name": "基围虾"
            },
            {
                "id": "21811",
                "name": "黄酒"
            },
            {
                "id": "21810",
                "name": "带皮五花肉块"
            },
            {
                "id": "21809",
                "name": "胡萝卜碎"
            },
            {
                "id": "21808",
                "name": "冬菇丁"
            },
            {
                "id": "21807",
                "name": "牛肉碎"
            },
            {
                "id": "21806",
                "name": "红灯笼椒丁"
            },
            {
                "id": "21805",
                "name": "红灯笼椒片"
            },
            {
                "id": "21804",
                "name": "松子"
            },
            {
                "id": "21803",
                "name": "鲈鱼粒"
            },
            {
                "id": "21802",
                "name": "小葱丝"
            },
            {
                "id": "21801",
                "name": "泡发油面筋"
            },
            {
                "id": "15902",
                "name": "鲜鸡油块"
            },
            {
                "id": "15903",
                "name": "鲜贝丁"
            },
            {
                "id": "15904",
                "name": "浓缩’鸡汁"
            },
            {
                "id": "16001",
                "name": "浓汤宝"
            },
            {
                "id": "16002",
                "name": "佛手瓜片"
            },
            {
                "id": "15905",
                "name": "白腐乳碎"
            },
            {
                "id": "16101",
                "name": "丝瓜片"
            },
            {
                "id": "16201",
                "name": "茼蒿段"
            },
            {
                "id": "16301",
                "name": "玉米粒"
            },
            {
                "id": "16302",
                "name": "鸡爪段"
            },
            {
                "id": "16303",
                "name": "蒜丁"
            },
            {
                "id": "16304",
                "name": "松仁"
            },
            {
                "id": "16305",
                "name": "白蘑菇片"
            },
            {
                "id": "16306",
                "name": "海鲜菇段"
            },
            {
                "id": "16307",
                "name": "平菇条"
            },
            {
                "id": "16401",
                "name": "虫草花"
            },
            {
                "id": "16308",
                "name": "改花刀鲍鱼"
            },
            {
                "id": "16309",
                "name": "白萝卜块"
            },
            {
                "id": "16402",
                "name": "香干条"
            },
            {
                "id": "16310",
                "name": "河鳗干片"
            },
            {
                "id": "16311",
                "name": "牛肉丝"
            },
            {
                "id": "16312",
                "name": "干辣椒丝"
            },
            {
                "id": "16313",
                "name": "贡菜段"
            },
            {
                "id": "16403",
                "name": "红油"
            },
            {
                "id": "16404",
                "name": "小龙虾尾"
            },
            {
                "id": "16405",
                "name": "麻辣小龙虾调味料"
            },
            {
                "id": "16406",
                "name": "啤酒"
            },
            {
                "id": "16601",
                "name": "油面筋块"
            },
            {
                "id": "16602",
                "name": "咸肉条"
            },
            {
                "id": "16603",
                "name": "莴笋块"
            },
            {
                "id": "16604",
                "name": "百叶结"
            },
            {
                "id": "16605",
                "name": "白洋葱片"
            },
            {
                "id": "16606",
                "name": "十三香小龙虾调味料"
            },
            {
                "id": "16607",
                "name": "花椒油"
            },
            {
                "id": "16701",
                "name": "蛤蜊肉"
            },
            {
                "id": "16801",
                "name": "去骨鸡腿块"
            },
            {
                "id": "16901",
                "name": "纯牛奶"
            },
            {
                "id": "17001",
                "name": "藤椒油"
            },
            {
                "id": "17002",
                "name": "外婆菜"
            },
            {
                "id": "17101",
                "name": "杭椒段"
            },
            {
                "id": "17102",
                "name": "熟鳝鱼条"
            },
            {
                "id": "17003",
                "name": "菠菜段"
            },
            {
                "id": "17004",
                "name": "白香干丝"
            },
            {
                "id": "12001",
                "name": "猪五花肉"
            },
            {
                "id": "17103",
                "name": "青菜丝"
            },
            {
                "id": "12101",
                "name": "牛肉片"
            },
            {
                "id": "17104",
                "name": "内脂豆腐丁"
            },
            {
                "id": "12201",
                "name": "小米椒圈"
            },
            {
                "id": "17105",
                "name": "龙井茶叶"
            },
            {
                "id": "12301",
                "name": "蒜碎"
            },
            {
                "id": "17106",
                "name": "红苋菜段"
            },
            {
                "id": "12302",
                "name": "香菜段"
            },
            {
                "id": "12303",
                "name": "干辣椒"
            },
            {
                "id": "17201",
                "name": "米粉"
            },
            {
                "id": "12304",
                "name": "花椒"
            },
            {
                "id": "17108",
                "name": "草菇块"
            },
            {
                "id": "12305",
                "name": "猪肝片"
            },
            {
                "id": "17109",
                "name": "黄豆酱"
            },
            {
                "id": "12306",
                "name": "螺丝椒片"
            },
            {
                "id": "17202",
                "name": "雪菜段"
            },
            {
                "id": "12307",
                "name": "花菜块"
            },
            {
                "id": "17203",
                "name": "猪腰片"
            },
            {
                "id": "12308",
                "name": "番茄块"
            },
            {
                "id": "17110",
                "name": "泡野山椒圈"
            },
            {
                "id": "17204",
                "name": "辣椒酱"
            },
            {
                "id": "12310",
                "name": "蒜净菜包"
            },
            {
                "id": "17205",
                "name": "新疆干辣椒段"
            },
            {
                "id": "12311",
                "name": "菌菇净菜包"
            },
            {
                "id": "17111",
                "name": "韧豆腐片"
            },
            {
                "id": "12312",
                "name": "青红椒净菜包"
            },
            {
                "id": "12313",
                "name": "牛肉粒净菜包"
            },
            {
                "id": "17206",
                "name": "碎米芽菜"
            },
            {
                "id": "12314",
                "name": "改刀鸡翅中"
            },
            {
                "id": "17113",
                "name": "午餐肉碎"
            },
            {
                "id": "12315",
                "name": "可乐"
            },
            {
                "id": "17114",
                "name": "午餐肉丝"
            },
            {
                "id": "12316",
                "name": "肉片、蒜净菜包"
            },
            {
                "id": "17207",
                "name": "泡发黑木耳丁"
            },
            {
                "id": "12317",
                "name": "香干净菜包"
            },
            {
                "id": "17208",
                "name": "白蘑菇块"
            },
            {
                "id": "12318",
                "name": "芹菜、辣椒净菜包"
            },
            {
                "id": "17209",
                "name": "牛肉粒"
            },
            {
                "id": "12319",
                "name": "肉蒜净菜包"
            },
            {
                "id": "17210",
                "name": "莴笋丝"
            },
            {
                "id": "12320",
                "name": "辣椒、豆豉净菜包"
            },
            {
                "id": "17211",
                "name": "鱿鱼片"
            },
            {
                "id": "12321",
                "name": "鸡翅中块"
            },
            {
                "id": "12322",
                "name": "姜丁"
            },
            {
                "id": "17115",
                "name": "大葱段"
            },
            {
                "id": "12323",
                "name": "蒜（整颗）"
            },
            {
                "id": "17116",
                "name": "去骨鸡腿肉粒"
            },
            {
                "id": "12324",
                "name": "小葱段"
            },
            {
                "id": "17213",
                "name": "小米椒碎"
            },
            {
                "id": "12325",
                "name": "红彩椒条"
            },
            {
                "id": "17117",
                "name": "花生碎"
            },
            {
                "id": "12326",
                "name": "开背虾仁"
            },
            {
                "id": "17214",
                "name": "香芹丁"
            },
            {
                "id": "12327",
                "name": "小葱花粒"
            },
            {
                "id": "17118",
                "name": "小葱花"
            },
            {
                "id": "17119",
                "name": "虾仁"
            },
            {
                "id": "12329",
                "name": "菜心段"
            },
            {
                "id": "17120",
                "name": "鸡蛋清"
            },
            {
                "id": "12330",
                "name": "娃娃菜片"
            },
            {
                "id": "17215",
                "name": "红尖椒丁"
            },
            {
                "id": "12331",
                "name": "包菜片"
            },
            {
                "id": "17121",
                "name": "泡野山椒"
            },
            {
                "id": "12501",
                "name": "去皮猪五花肉片"
            },
            {
                "id": "17122",
                "name": "泡红灯笼椒"
            },
            {
                "id": "12502",
                "name": "整颗蒜"
            },
            {
                "id": "17501",
                "name": "韧豆腐块"
            },
            {
                "id": "12503",
                "name": "蒜沫"
            },
            {
                "id": "17601",
                "name": "清水笋丝"
            },
            {
                "id": "12601",
                "name": "鸡腿块"
            },
            {
                "id": "17602",
                "name": "清水笋尖"
            },
            {
                "id": "12602",
                "name": "香菇片"
            },
            {
                "id": "17701",
                "name": "冰鲜带子"
            },
            {
                "id": "12603",
                "name": "蒜块"
            },
            {
                "id": "17801",
                "name": "黄瓜厚片"
            },
            {
                "id": "12604",
                "name": "熟米饭"
            },
            {
                "id": "17901",
                "name": "扁豆丝"
            },
            {
                "id": "12605",
                "name": "蒜苔段"
            },
            {
                "id": "18001",
                "name": "虾仁丁"
            },
            {
                "id": "12606",
                "name": "丝瓜块"
            },
            {
                "id": "18101",
                "name": "雪菜碎"
            },
            {
                "id": "12607",
                "name": "长茄块"
            },
            {
                "id": "18102",
                "name": "泡发米粉"
            },
            {
                "id": "12608",
                "name": "干辣椒段"
            },
            {
                "id": "18201",
                "name": "茭白块"
            },
            {
                "id": "12701",
                "name": "姜丝"
            },
            {
                "id": "18202",
                "name": "去壳板栗"
            },
            {
                "id": "12702",
                "name": "大葱丝"
            },
            {
                "id": "18203",
                "name": "鸡腿块（手枪腿）"
            },
            {
                "id": "12703",
                "name": "莲藕片"
            },
            {
                "id": "18204",
                "name": "蟹味菇段"
            },
            {
                "id": "12704",
                "name": "腊肠片"
            },
            {
                "id": "18205",
                "name": "泡发笋干段"
            },
            {
                "id": "12705",
                "name": "荷兰豆"
            },
            {
                "id": "18206",
                "name": "黄冰糖"
            },
            {
                "id": "12706",
                "name": "蒜片"
            },
            {
                "id": "18207",
                "name": "去籽枇杷块"
            },
            {
                "id": "12707",
                "name": "青尖椒丝"
            },
            {
                "id": "18208",
                "name": "鸭块"
            },
            {
                "id": "12708",
                "name": "猪瘦肉丝"
            },
            {
                "id": "18209",
                "name": "罗勒叶"
            },
            {
                "id": "12709",
                "name": "油麦菜段"
            },
            {
                "id": "18210",
                "name": "南瓜片"
            },
            {
                "id": "12710",
                "name": "大葱花"
            },
            {
                "id": "18211",
                "name": "蚕豆瓣"
            },
            {
                "id": "12801",
                "name": "小油菜段"
            },
            {
                "id": "18212",
                "name": "茭白片"
            },
            {
                "id": "12802",
                "name": "韭菜段"
            },
            {
                "id": "18213",
                "name": "青尖椒条"
            },
            {
                "id": "12803",
                "name": "番茄片"
            },
            {
                "id": "18214",
                "name": "鸭腿肉块"
            },
            {
                "id": "12804",
                "name": "小油菜丁"
            },
            {
                "id": "18215",
                "name": "鸡头米"
            },
            {
                "id": "12805",
                "name": "西芹块"
            },
            {
                "id": "18216",
                "name": "芋头块"
            },
            {
                "id": "12806",
                "name": "鲜百合片"
            },
            {
                "id": "18217",
                "name": "百合"
            },
            {
                "id": "12807",
                "name": "红尖椒片"
            },
            {
                "id": "18218",
                "name": "椰浆"
            },
            {
                "id": "12808",
                "name": "胡萝卜片"
            },
            {
                "id": "18401",
                "name": "泡发鸡头米"
            },
            {
                "id": "12809",
                "name": "青蒜小段"
            },
            {
                "id": "12901",
                "name": "春笋块"
            },
            {
                "id": "18502",
                "name": "荔浦芋头块"
            },
            {
                "id": "12902",
                "name": "火腿肠丁"
            },
            {
                "id": "18601",
                "name": "免浆黑鱼片"
            },
            {
                "id": "13001",
                "name": "海米"
            },
            {
                "id": "18602",
                "name": "黄瓜条"
            },
            {
                "id": "13002",
                "name": "皮蛋丁"
            },
            {
                "id": "18603",
                "name": "柠檬片"
            },
            {
                "id": "13003",
                "name": "卤肥肠段"
            },
            {
                "id": "18604",
                "name": "酸辣金汤"
            },
            {
                "id": "13004",
                "name": "八角"
            },
            {
                "id": "18605",
                "name": "白萝卜丝"
            },
            {
                "id": "13005",
                "name": "带鱼段"
            },
            {
                "id": "18606",
                "name": "菠萝块"
            },
            {
                "id": "13006",
                "name": "西葫芦片"
            },
            {
                "id": "18607",
                "name": "椒盐粉"
            },
            {
                "id": "13007",
                "name": "熟花生米"
            },
            {
                "id": "18608",
                "name": "黄豆芽"
            },
            {
                "id": "13008",
                "name": "四季豆丝"
            },
            {
                "id": "18609",
                "name": "青尖椒碎"
            },
            {
                "id": "13009",
                "name": "冬瓜片"
            },
            {
                "id": "18610",
                "name": "腊肉片"
            },
            {
                "id": "13010",
                "name": "香菇丁"
            },
            {
                "id": "18611",
                "name": "五花肉丝净菜包"
            },
            {
                "id": "13011",
                "name": "娃娃菜长片"
            },
            {
                "id": "18612",
                "name": "笋丝净菜包"
            },
            {
                "id": "13012",
                "name": "去须大虾"
            },
            {
                "id": "18613",
                "name": "香芹段净菜包"
            },
            {
                "id": "13013",
                "name": "姜沫"
            },
            {
                "id": "18614",
                "name": "蒜碎小料包"
            },
            {
                "id": "13014",
                "name": "姜片"
            },
            {
                "id": "18801",
                "name": "去皮五花肉净菜包"
            },
            {
                "id": "13201",
                "name": "红尖椒条"
            },
            {
                "id": "18802",
                "name": "猪瘦肉净菜包"
            },
            {
                "id": "13202",
                "name": "开背虾"
            },
            {
                "id": "13203",
                "name": "豆豉鲮鱼块"
            },
            {
                "id": "18804",
                "name": "豆豉净菜包"
            },
            {
                "id": "13204",
                "name": "鱿鱼须"
            },
            {
                "id": "18805",
                "name": "青辣椒净菜包"
            },
            {
                "id": "13205",
                "name": "蒜苔丁"
            },
            {
                "id": "18806",
                "name": "黄牛肉净菜包"
            },
            {
                "id": "13206",
                "name": "孜然粒"
            },
            {
                "id": "18807",
                "name": "红线椒净菜包"
            },
            {
                "id": "13207",
                "name": "白洋葱条"
            },
            {
                "id": "18808",
                "name": "猪肉沫净菜包"
            },
            {
                "id": "13208",
                "name": "老豆腐块"
            },
            {
                "id": "18809",
                "name": "卜豆角净菜包"
            },
            {
                "id": "13209",
                "name": "山药片"
            },
            {
                "id": "18810",
                "name": "蒜苗净菜包"
            },
            {
                "id": "13210",
                "name": "泡发黑木耳片"
            },
            {
                "id": "18811",
                "name": "罗汉笋丁净菜包"
            },
            {
                "id": "13211",
                "name": "猪五花肉沫"
            },
            {
                "id": "18812",
                "name": "梅酸菜净菜包"
            },
            {
                "id": "13212",
                "name": "酸豆角丁"
            },
            {
                "id": "18813",
                "name": "攸县香干净菜包"
            },
            {
                "id": "13213",
                "name": "茭白丝"
            },
            {
                "id": "13401",
                "name": "红尖椒丝"
            },
            {
                "id": "18815",
                "name": "酸豆角净菜包"
            },
            {
                "id": "13402",
                "name": "千页豆腐片"
            },
            {
                "id": "18816",
                "name": "肥肠段净菜包"
            },
            {
                "id": "13403",
                "name": "青蒜段"
            },
            {
                "id": "18817",
                "name": "小姜黄净菜包"
            },
            {
                "id": "13404",
                "name": "杏鲍菇片"
            },
            {
                "id": "19001",
                "name": "青红辣椒净菜包"
            },
            {
                "id": "13405",
                "name": "青尖椒片"
            },
            {
                "id": "19002",
                "name": "芹菜净菜包"
            },
            {
                "id": "13406",
                "name": "土豆丝"
            },
            {
                "id": "19101",
                "name": "小葱花净菜包"
            },
            {
                "id": "13407",
                "name": "牛腩块"
            },
            {
                "id": "13408",
                "name": "土豆块"
            },
            {
                "id": "19301",
                "name": "螺丝椒净菜包"
            },
            {
                "id": "13409",
                "name": "白菜片"
            },
            {
                "id": "13410",
                "name": "腊肠粒"
            },
            {
                "id": "19303",
                "name": "豌豆"
            },
            {
                "id": "13411",
                "name": "莴笋片"
            },
            {
                "id": "13412",
                "name": "韭黄段"
            },
            {
                "id": "13413",
                "name": "去骨鸡腿肉丁"
            },
            {
                "id": "13602",
                "name": "玉米胡萝卜净菜包"
            },
            {
                "id": "13603",
                "name": "松仁净菜包"
            },
            {
                "id": "13701",
                "name": "金华火腿丁"
            },
            {
                "id": "13801",
                "name": "春笋长块"
            },
            {
                "id": "13902",
                "name": "绿豆芽"
            },
            {
                "id": "13903",
                "name": "湿河粉"
            },
            {
                "id": "14002",
                "name": "豆豉"
            },
            {
                "id": "14003",
                "name": "咸鱼丁"
            },
            {
                "id": "14004",
                "name": "去皮茄条"
            },
            {
                "id": "14005",
                "name": "菠萝丁"
            },
            {
                "id": "14006",
                "name": "胡萝卜丁"
            },
            {
                "id": "14007",
                "name": "豌豆仁"
            },
            {
                "id": "14008",
                "name": "蚕豆仁"
            },
            {
                "id": "14009",
                "name": "芥兰片"
            },
            {
                "id": "14010",
                "name": "芦笋段"
            },
            {
                "id": "14011",
                "name": "香椿碎"
            },
            {
                "id": "14012",
                "name": "红葱头块"
            },
            {
                "id": "14013",
                "name": "姜块"
            },
            {
                "id": "14014",
                "name": "红皮花生"
            },
            {
                "id": "14202",
                "name": "水东芥菜块"
            },
            {
                "id": "14203",
                "name": "胡萝卜块"
            },
            {
                "id": "14204",
                "name": "肥猪肉片"
            },
            {
                "id": "14205",
                "name": "拍蒜"
            },
            {
                "id": "14206",
                "name": "咖喱块"
            },
            {
                "id": "14301",
                "name": "土豆丁"
            },
            {
                "id": "14401",
                "name": "胡萝卜滚刀块"
            },
            {
                "id": "14501",
                "name": "西兰花块"
            },
            {
                "id": "14503",
                "name": "切片年糕块"
            },
            {
                "id": "14504",
                "name": "白菜丝"
            },
            {
                "id": "14505",
                "name": "香芹段"
            },
            {
                "id": "14506",
                "name": "银耳碎"
            },
            {
                "id": "14507",
                "name": "莲子"
            },
            {
                "id": "14508",
                "name": "红枣"
            },
            {
                "id": "14509",
                "name": "毛豆仁"
            },
            {
                "id": "14510",
                "name": "冰糖"
            },
            {
                "id": "14601",
                "name": "胡萝卜丝"
            },
            {
                "id": "14701",
                "name": "水"
            },
            {
                "id": "14801",
                "name": "橄榄菜"
            },
            {
                "id": "14802",
                "name": "四季豆丁"
            },
            {
                "id": "14901",
                "name": "番茄酱"
            },
            {
                "id": "14902",
                "name": "黄瓜片"
            },
            {
                "id": "14903",
                "name": "莲藕半片"
            },
            {
                "id": "14904",
                "name": "韭菜苔段"
            },
            {
                "id": "14905",
                "name": "鱿鱼丝"
            },
            {
                "id": "14906",
                "name": "鸡枞菌条"
            },
            {
                "id": "14907",
                "name": "牛柳条"
            },
            {
                "id": "14908",
                "name": "枸杞"
            },
            {
                "id": "15001",
                "name": "干锅酱"
            },
            {
                "id": "15101",
                "name": "XO酱"
            },
            {
                "id": "15102",
                "name": "豆瓣酱"
            },
            {
                "id": "15103",
                "name": "火锅底料"
            },
            {
                "id": "15104",
                "name": "猪里脊丝"
            },
            {
                "id": "15105",
                "name": "鸭血块"
            },
            {
                "id": "15106",
                "name": "四季豆段"
            },
            {
                "id": "15107",
                "name": "冬笋丝"
            },
            {
                "id": "15108",
                "name": "木耳丝"
            },
            {
                "id": "15109",
                "name": "泡椒酱"
            },
            {
                "id": "15201",
                "name": "土鸡块"
            },
            {
                "id": "15202",
                "name": "红豆"
            },
            {
                "id": "15203",
                "name": "红糖"
            },
            {
                "id": "15204",
                "name": "鲜人参片"
            },
            {
                "id": "15301",
                "name": "花椒面"
            },
            {
                "id": "15302",
                "name": "辣椒面"
            },
            {
                "id": "15401",
                "name": "食盐"
            },
            {
                "id": "15501",
                "name": "鱼头"
            },
            {
                "id": "15502",
                "name": "红剁辣椒"
            },
            {
                "id": "15503",
                "name": "黄灯笼剁椒酱"
            },
            {
                "id": "15504",
                "name": "腐竹段"
            },
            {
                "id": "15505",
                "name": "生抽"
            },
            {
                "id": "15601",
                "name": "白胡椒粉"
            },
            {
                "id": "15602",
                "name": "蒜蓉酱"
            },
            {
                "id": "15506",
                "name": "龙口粉丝"
            },
            {
                "id": "15507",
                "name": "水淀粉"
            },
            {
                "id": "15508",
                "name": "开边大虾"
            },
            {
                "id": "15509",
                "name": "红尖椒碎"
            },
            {
                "id": "15510",
                "name": "空心菜段"
            },
            {
                "id": "15511",
                "name": "白洋葱丁"
            },
            {
                "id": "15603",
                "name": "咖喱粉"
            },
            {
                "id": "15513",
                "name": "鲜香菇块"
            },
            {
                "id": "15514",
                "name": "熟手擀面"
            },
            {
                "id": "15515",
                "name": "猪五花肉丝"
            },
            {
                "id": "15604",
                "name": "圆白菜丝"
            },
            {
                "id": "15516",
                "name": "茶树菇段"
            },
            {
                "id": "15517",
                "name": "青线椒圈"
            },
            {
                "id": "15605",
                "name": "红美人椒圈"
            },
            {
                "id": "15606",
                "name": "鲜花椒"
            },
            {
                "id": "15518",
                "name": "青小米椒圈"
            },
            {
                "id": "15519",
                "name": "大葱片"
            },
            {
                "id": "15520",
                "name": "金针菇"
            },
            {
                "id": "15607",
                "name": "蟹肉棒段"
            },
            {
                "id": "15608",
                "name": "午餐肉片"
            },
            {
                "id": "15521",
                "name": "熟鹌鹑蛋"
            },
            {
                "id": "15522",
                "name": "莴笋条"
            },
            {
                "id": "15609",
                "name": "海带苗段"
            },
            {
                "id": "15523",
                "name": "干灯笼椒"
            },
            {
                "id": "15610",
                "name": "麻椒"
            },
            {
                "id": "15524",
                "name": "麻辣香锅酱"
            },
            {
                "id": "15525",
                "name": "熟白芝麻"
            },
            {
                "id": "15526",
                "name": "鲜笋尖段"
            },
            {
                "id": "15801",
                "name": "排骨块"
            },
            {
                "id": "15901",
                "name": "牛蛙块"
            },
            {
                "id": "21701",
                "name": "羊腿肉块"
            },
            {
                "id": "21607",
                "name": "金针菇段"
            },
            {
                "id": "21606",
                "name": "扇贝肉"
            },
            {
                "id": "21605",
                "name": "螺丝肉"
            },
            {
                "id": "21604",
                "name": "秋葵段"
            },
            {
                "id": "21603",
                "name": "香干"
            },
            {
                "id": "21602",
                "name": "西芹段"
            },
            {
                "id": "21601",
                "name": "核桃仁"
            },
            {
                "id": "21413",
                "name": "香菇粒"
            },
            {
                "id": "21412",
                "name": "春笋粒"
            },
            {
                "id": "21411",
                "name": "鸡胗粒"
            },
            {
                "id": "21410",
                "name": "虾米"
            },
            {
                "id": "21409",
                "name": "咸鸭蛋黄"
            },
            {
                "id": "21408",
                "name": "娃娃菜段"
            },
            {
                "id": "21407",
                "name": "黄彩椒条"
            },
            {
                "id": "21406",
                "name": "裙带菜段"
            },
            {
                "id": "21405",
                "name": "花甲"
            },
            {
                "id": "21404",
                "name": "嫩豆腐块"
            },
            {
                "id": "21403",
                "name": "鲈鱼"
            },
            {
                "id": "21402",
                "name": "虾皮"
            },
            {
                "id": "21401",
                "name": "小箱豆腐块"
            },
            {
                "id": "21303",
                "name": "花生米净菜包"
            },
            {
                "id": "21302",
                "name": "宫保汁包"
            },
            {
                "id": "21301",
                "name": "大葱丁净菜包"
            },
            {
                "id": "21203",
                "name": "牛柳片净菜包"
            },
            {
                "id": "21202",
                "name": "杭椒净菜"
            },
            {
                "id": "21201",
                "name": "黑胡椒汁包"
            },
            {
                "id": "21104",
                "name": "腊肉净菜包"
            },
            {
                "id": "21103",
                "name": "笋尖净菜包"
            },
            {
                "id": "21102",
                "name": "虾仁净菜包"
            },
            {
                "id": "21101",
                "name": "腰果净菜包"
            },
            {
                "id": "21001",
                "name": "藤椒肥肠酱汁包"
            },
            {
                "id": "20901",
                "name": "笔管鱿鱼段"
            },
            {
                "id": "20717",
                "name": "农耕记净菜"
            },
            {
                "id": "20716",
                "name": "鸭血净菜包"
            },
            {
                "id": "20715",
                "name": "粉条净菜包"
            },
            {
                "id": "20714",
                "name": "蒜块净菜包"
            },
            {
                "id": "20713",
                "name": "青椒圈净菜包"
            },
            {
                "id": "20712",
                "name": "麻花净菜包"
            },
            {
                "id": "20711",
                "name": "干辣椒净菜包"
            },
            {
                "id": "20710",
                "name": "腌鸡丁净菜包"
            },
            {
                "id": "20709",
                "name": "红美人椒净菜包"
            },
            {
                "id": "20708",
                "name": "卤耳丝净菜包"
            },
            {
                "id": "20707",
                "name": "鸡块净菜包"
            },
            {
                "id": "20706",
                "name": "蒜碎净菜"
            },
            {
                "id": "20705",
                "name": "青红美人椒净菜包"
            },
            {
                "id": "20704",
                "name": "青笋条净菜包"
            },
            {
                "id": "20703",
                "name": "鲜花椒净菜包"
            },
            {
                "id": "20702",
                "name": "肥肠净菜包"
            },
            {
                "id": "20701",
                "name": "鱼虾净菜包"
            },
            {
                "id": "20605",
                "name": "青椒碎净菜包"
            },
            {
                "id": "20604",
                "name": "黄瓜块净菜包"
            },
            {
                "id": "20603",
                "name": "湘味五花肉净菜包"
            },
            {
                "id": "20602",
                "name": "小料净菜包"
            },
            {
                "id": "20601",
                "name": "鸡胗净菜包"
            },
            {
                "id": "20501",
                "name": "牛心管"
            },
            {
                "id": "20408",
                "name": "香辣酥"
            },
            {
                "id": "20407",
                "name": "掌中宝"
            },
            {
                "id": "20406",
                "name": "莲藕丁"
            },
            {
                "id": "20405",
                "name": "杏鲍菇丝"
            },
            {
                "id": "20404",
                "name": "滚刀葱"
            },
            {
                "id": "20403",
                "name": "羊腿肉片"
            },
            {
                "id": "20402",
                "name": "黑臭豆腐条"
            },
            {
                "id": "20401",
                "name": "螺丝椒丝"
            },
            {
                "id": "20231",
                "name": "鲍鱼净菜包"
            },
            {
                "id": "20230",
                "name": "卤牛肚净菜包"
            },
            {
                "id": "20229",
                "name": "酸萝卜净菜包"
            },
            {
                "id": "20228",
                "name": "回锅肉调料包"
            },
            {
                "id": "20227",
                "name": "蒜片净菜包"
            },
            {
                "id": "20226",
                "name": "干辣椒段净菜包"
            },
            {
                "id": "20225",
                "name": "熟五花肉净菜包"
            },
            {
                "id": "20224",
                "name": "干香菇条"
            },
            {
                "id": "20223",
                "name": "干鱿鱼条"
            },
            {
                "id": "20222",
                "name": "去皮蚕豆"
            },
            {
                "id": "20221",
                "name": "带皮咸肉片"
            },
            {
                "id": "20220",
                "name": "口蘑片"
            },
            {
                "id": "20219",
                "name": "黄鳝段"
            },
            {
                "id": "20218",
                "name": "活河虾"
            },
            {
                "id": "20217",
                "name": "芝麻油"
            },
            {
                "id": "20216",
                "name": "淀粉水"
            },
            {
                "id": "20215",
                "name": "海兔"
            },
            {
                "id": "20214",
                "name": "水发蹄筋段"
            },
            {
                "id": "20212",
                "name": "小河虾仁"
            },
            {
                "id": "20211",
                "name": "油面筋"
            },
            {
                "id": "20210",
                "name": "去皮五花肉丝"
            },
            {
                "id": "20209",
                "name": "蚕豆"
            },
            {
                "id": "20208",
                "name": "虾干"
            },
            {
                "id": "20207",
                "name": "香叶"
            },
            {
                "id": "20206",
                "name": "酒酿"
            },
            {
                "id": "20205",
                "name": "桂皮"
            },
            {
                "id": "20204",
                "name": "麻鸭块"
            },
            {
                "id": "20203",
                "name": "酱油肉条"
            },
            {
                "id": "20202",
                "name": "香糟卤"
            },
            {
                "id": "20201",
                "name": "干虾子"
            },
            {
                "id": "20101",
                "name": "杭椒圈"
            },
            {
                "id": "19913",
                "name": "泡辣椒"
            },
            {
                "id": "19912",
                "name": "仔姜片"
            },
            {
                "id": "19910",
                "name": "紫苏叶丝"
            },
            {
                "id": "19909",
                "name": "魔芋豆腐条"
            },
            {
                "id": "19908",
                "name": "鸡蛋"
            },
            {
                "id": "19907",
                "name": "鸭舌"
            },
            {
                "id": "19906",
                "name": "红剁椒"
            },
            {
                "id": "19905",
                "name": "黄芽白条"
            },
            {
                "id": "19904",
                "name": "咖喱"
            },
            {
                "id": "19903",
                "name": "去皮五花肉块"
            },
            {
                "id": "19902",
                "name": "去壳鲍鱼"
            },
            {
                "id": "19901",
                "name": "泡发黑木耳"
            },
            {
                "id": "19801",
                "name": "黑胡椒酱料包"
            },
            {
                "id": "19614",
                "name": "紫苏碎"
            },
            {
                "id": "19613",
                "name": "红美人椒粒"
            },
            {
                "id": "19612",
                "name": "五花肉沫"
            },
            {
                "id": "19611",
                "name": "腌雪里红碎"
            },
            {
                "id": "19609",
                "name": "蒜"
            },
            {
                "id": "19608",
                "name": "辣妹子"
            },
            {
                "id": "19606",
                "name": "小米椒条"
            },
            {
                "id": "19605",
                "name": "青线椒条"
            },
            {
                "id": "19604",
                "name": "红美人椒条"
            },
            {
                "id": "19603",
                "name": "去皮五花肉片"
            },
            {
                "id": "19602",
                "name": "去皮五花肉粒"
            },
            {
                "id": "19601",
                "name": "蒜苔粒"
            },
            {
                "id": "19509",
                "name": "胡椒粉"
            },
            {
                "id": "19508",
                "name": "番薯叶"
            },
            {
                "id": "19507",
                "name": "姜碎"
            },
            {
                "id": "19506",
                "name": "虾酱"
            },
            {
                "id": "19505",
                "name": "枸杞叶"
            },
            {
                "id": "19504",
                "name": "西米"
            },
            {
                "id": "19503",
                "name": "丝瓜条"
            },
            {
                "id": "19502",
                "name": "南乳"
            },
            {
                "id": "19501",
                "name": "话梅"
            },
            {
                "id": "19408",
                "name": "沙姜碎"
            },
            {
                "id": "19407",
                "name": "糖桂花"
            },
            {
                "id": "19406",
                "name": "桂花"
            },
            {
                "id": "19404",
                "name": "白玉菇段"
            },
            {
                "id": "19405",
                "name": "草菇片"
            },
            {
                "id": "19403",
                "name": "沙姜片"
            },
            {
                "id": "19402",
                "name": "荠菜碎"
            },
            {
                "id": "19401",
                "name": "盐焗鸡粉"
            }
        ])
        name.value=currentRoute.value.query.name
        code.value=currentRoute.value.query.code
        if(currentRoute.value.query.id=='1'){
            menu.value=menu1.value
        }else if(currentRoute.value.query.id=='2'){
            menu.value=menu2.value
        }else if(currentRoute.value.query.id=='3'){
            menu.value=menu3.value
        }else if(currentRoute.value.query.id=='4'){
            menu.value=menu4.value
        }else if(currentRoute.value.query.id=='5'){
            menu.value=menu5.value
        }else if(currentRoute.value.query.id=='6'){
            menu.value=menu6.value
        }else if(currentRoute.value.query.id=='7'){
            menu.value=menu7.value
        }else if(currentRoute.value.query.id=='8'){
            menu.value=menu8.value
        }
        const handleCancel = () => {
            previewVisible.value = false;
        };
        const handlePreview = async file => {
            if (!file.url && !file.preview) {
                file.preview = await getBase64(file.originFileObj);
            }
            previewImage.value = file.url || file.preview;
            previewVisible.value = true;
        };
        const handleChange = ({ fileList: newFileList }) => {
            fileList.value = newFileList;
        };

        return{
            name,
            code,
            value1,
            selectData,
            value2,
            previewVisible,
            previewImage,
            fileList,
            handleCancel,
            handlePreview,
            handleChange,
            des,
            menu1,
            menu2,
            menu3,
            menu4,
            menu5,
            menu6,
            menu7,
            menu8,
            menu,
        }
    }
})

</script>
<style lang="less" scoped>
.container{
    .flowContainer{
        .flowContent{
            .flowTop{
                background-color: #e6f4ff;
                border: 1px solid #91caff;
                box-sizing: border-box;
                margin: 0;
                padding: 8px 12px;
                color: rgba(0, 0, 0, 0.88);
                font-size: 14px;
                line-height: 1.5714285714285714;
                list-style: none;
                font-family: -apple-system,BlinkMacSystemFont,'Segoe UI',Roboto,'Helvetica Neue',Arial,'Noto Sans',sans-serif,'Apple Color Emoji','Segoe UI Emoji','Segoe UI Symbol','Noto Color Emoji';
                position: relative;
                display: flex;
                align-items: center;
                word-wrap: break-word;
                border-radius: 8px;
                margin-bottom:20px;
            }
        }
    }
    .baseInfo{
        .infoContent{
            display: flex;
            flex-wrap: wrap;
            justify-content: space-between;
            p{
                width: 22%;
            }
        }
    }
}
</style>